; domain
;; Transport sequential
;;

(define (domain transport)
  (:requirements :typing :action-costs)
  (:types
        location target locatable - object
        vehicle package - locatable
        capacity-number - object
  )

  (:predicates 
     (road ?l1 ?l2 - location)
     (at ?x - locatable ?v - location)
     (in ?x - package ?v - vehicle)
     (capacity ?v - vehicle ?s1 - capacity-number)
     (capacity-predecessor ?s1 ?s2 - capacity-number)
  )

  (:functions
     (road-length ?l1 ?l2 - location) - number
     (total-cost) - number
  )

  (:action drive
    :parameters (?v - vehicle ?l1 ?l2 - location)
    :precondition (and
        (at ?v ?l1)
        (road ?l1 ?l2)
      )
    :effect (and
        (not (at ?v ?l1))
        (at ?v ?l2)
        (increase (total-cost) (road-length ?l1 ?l2))
      )
  )

 (:action pick-up
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - capacity-number)
    :precondition (and
        (at ?v ?l)
        (at ?p ?l)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s2)
      )
    :effect (and
        (not (at ?p ?l))
        (in ?p ?v)
        (capacity ?v ?s1)
        (not (capacity ?v ?s2))
        (increase (total-cost) 1)
      )
  )

  (:action drop
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - capacity-number)
    :precondition (and
        (at ?v ?l)
        (in ?p ?v)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s1)
      )
    :effect (and
        (not (in ?p ?v))
        (at ?p ?l)
        (capacity ?v ?s2)
        (not (capacity ?v ?s1))
        (increase (total-cost) 1)
      )
  )

)

; problem
; Transport two-cities-sequential-5nodes-1000size-4degree-100mindistance-2trucks-4packages-403seed

(define (problem transport-two-cities-sequential-5nodes-1000size-4degree-100mindistance-2trucks-4packages-403seed)
 (:domain transport)
 (:objects
  city-1-loc-1 - location
  city-2-loc-1 - location
  city-1-loc-2 - location
  city-2-loc-2 - location
  city-1-loc-3 - location
  city-2-loc-3 - location
  city-1-loc-4 - location
  city-2-loc-4 - location
  city-1-loc-5 - location
  city-2-loc-5 - location
  truck-1 - vehicle
  truck-2 - vehicle
  package-1 - package
  package-2 - package
  package-3 - package
  package-4 - package
  capacity-0 - capacity-number
  capacity-1 - capacity-number
  capacity-2 - capacity-number
  capacity-3 - capacity-number
  capacity-4 - capacity-number
 )
 (:init
  (= (total-cost) 0)
  (capacity-predecessor capacity-0 capacity-1)
  (capacity-predecessor capacity-1 capacity-2)
  (capacity-predecessor capacity-2 capacity-3)
  (capacity-predecessor capacity-3 capacity-4)
  ; 803,164 -> 350,36
  (road city-1-loc-3 city-1-loc-2)
  (= (road-length city-1-loc-3 city-1-loc-2) 48)
  ; 350,36 -> 803,164
  (road city-1-loc-2 city-1-loc-3)
  (= (road-length city-1-loc-2 city-1-loc-3) 48)
  ; 919,274 -> 803,164
  (road city-1-loc-4 city-1-loc-3)
  (= (road-length city-1-loc-4 city-1-loc-3) 16)
  ; 803,164 -> 919,274
  (road city-1-loc-3 city-1-loc-4)
  (= (road-length city-1-loc-3 city-1-loc-4) 16)
  ; 820,750 -> 255,639
  (road city-1-loc-5 city-1-loc-1)
  (= (road-length city-1-loc-5 city-1-loc-1) 58)
  ; 255,639 -> 820,750
  (road city-1-loc-1 city-1-loc-5)
  (= (road-length city-1-loc-1 city-1-loc-5) 58)
  ; 820,750 -> 803,164
  (road city-1-loc-5 city-1-loc-3)
  (= (road-length city-1-loc-5 city-1-loc-3) 59)
  ; 803,164 -> 820,750
  (road city-1-loc-3 city-1-loc-5)
  (= (road-length city-1-loc-3 city-1-loc-5) 59)
  ; 820,750 -> 919,274
  (road city-1-loc-5 city-1-loc-4)
  (= (road-length city-1-loc-5 city-1-loc-4) 49)
  ; 919,274 -> 820,750
  (road city-1-loc-4 city-1-loc-5)
  (= (road-length city-1-loc-4 city-1-loc-5) 49)
  ; 2153,541 -> 2721,488
  (road city-2-loc-2 city-2-loc-1)
  (= (road-length city-2-loc-2 city-2-loc-1) 57)
  ; 2721,488 -> 2153,541
  (road city-2-loc-1 city-2-loc-2)
  (= (road-length city-2-loc-1 city-2-loc-2) 57)
  ; 2899,566 -> 2721,488
  (road city-2-loc-3 city-2-loc-1)
  (= (road-length city-2-loc-3 city-2-loc-1) 20)
  ; 2721,488 -> 2899,566
  (road city-2-loc-1 city-2-loc-3)
  (= (road-length city-2-loc-1 city-2-loc-3) 20)
  ; 2863,386 -> 2721,488
  (road city-2-loc-4 city-2-loc-1)
  (= (road-length city-2-loc-4 city-2-loc-1) 18)
  ; 2721,488 -> 2863,386
  (road city-2-loc-1 city-2-loc-4)
  (= (road-length city-2-loc-1 city-2-loc-4) 18)
  ; 2863,386 -> 2899,566
  (road city-2-loc-4 city-2-loc-3)
  (= (road-length city-2-loc-4 city-2-loc-3) 19)
  ; 2899,566 -> 2863,386
  (road city-2-loc-3 city-2-loc-4)
  (= (road-length city-2-loc-3 city-2-loc-4) 19)
  ; 2762,763 -> 2721,488
  (road city-2-loc-5 city-2-loc-1)
  (= (road-length city-2-loc-5 city-2-loc-1) 28)
  ; 2721,488 -> 2762,763
  (road city-2-loc-1 city-2-loc-5)
  (= (road-length city-2-loc-1 city-2-loc-5) 28)
  ; 2762,763 -> 2899,566
  (road city-2-loc-5 city-2-loc-3)
  (= (road-length city-2-loc-5 city-2-loc-3) 24)
  ; 2899,566 -> 2762,763
  (road city-2-loc-3 city-2-loc-5)
  (= (road-length city-2-loc-3 city-2-loc-5) 24)
  ; 2762,763 -> 2863,386
  (road city-2-loc-5 city-2-loc-4)
  (= (road-length city-2-loc-5 city-2-loc-4) 39)
  ; 2863,386 -> 2762,763
  (road city-2-loc-4 city-2-loc-5)
  (= (road-length city-2-loc-4 city-2-loc-5) 39)
  ; 919,274 <-> 2153,541
  (road city-1-loc-4 city-2-loc-2)
  (= (road-length city-1-loc-4 city-2-loc-2) 127)
  (road city-2-loc-2 city-1-loc-4)
  (= (road-length city-2-loc-2 city-1-loc-4) 127)
  (at package-1 city-1-loc-3)
  (at package-2 city-1-loc-4)
  (at package-3 city-1-loc-2)
  (at package-4 city-1-loc-1)
  (at truck-1 city-2-loc-3)
  (capacity truck-1 capacity-2)
  (at truck-2 city-2-loc-2)
  (capacity truck-2 capacity-2)
 )
 (:goal (and
  (at package-1 city-2-loc-4)
  (at package-2 city-2-loc-2)
  (at package-3 city-2-loc-2)
  (at package-4 city-2-loc-5)
 ))
 (:metric minimize (total-cost))
)

; plan
1. (drive truck-2 city-2-loc-2 city-1-loc-4)
   deleted: (at truck-2 city-2-loc-2)
   added: (at truck-2 city-1-loc-4)
   goals met: 0 of 4
2. (pick-up truck-2 city-1-loc-4 package-2 capacity-1 capacity-2)
   deleted: (at package-2 city-1-loc-4) (capacity truck-2 capacity-2)
   added: (in package-2 truck-2) (capacity truck-2 capacity-1)
   goals met: 0 of 4
3. (drive truck-2 city-1-loc-4 city-1-loc-3)
   deleted: (at truck-2 city-1-loc-4)
   added: (at truck-2 city-1-loc-3)
   goals met: 0 of 4
4. (drive truck-2 city-1-loc-3 city-1-loc-2)
   deleted: (at truck-2 city-1-loc-3)
   added: (at truck-2 city-1-loc-2)
   goals met: 0 of 4
5. (pick-up truck-2 city-1-loc-2 package-3 capacity-0 capacity-1)
   deleted: (at package-3 city-1-loc-2) (capacity truck-2 capacity-1)
   added: (in package-3 truck-2) (capacity truck-2 capacity-0)
   goals met: 0 of 4
6. (drive truck-2 city-1-loc-2 city-1-loc-3)
   deleted: (at truck-2 city-1-loc-2)
   added: (at truck-2 city-1-loc-3)
   goals met: 0 of 4
7. (drive truck-2 city-1-loc-3 city-1-loc-4)
   deleted: (at truck-2 city-1-loc-3)
   added: (at truck-2 city-1-loc-4)
   goals met: 0 of 4
8. (drive truck-2 city-1-loc-4 city-2-loc-2)
   deleted: (at truck-2 city-1-loc-4)
   added: (at truck-2 city-2-loc-2)
   goals met: 0 of 4
9. (drop truck-2 city-2-loc-2 package-3 capacity-0 capacity-1)
   deleted: (in package-3 truck-2) (capacity truck-2 capacity-0)
   added: (at package-3 city-2-loc-2) (capacity truck-2 capacity-1)
   goals met: 1 of 4
10. (drop truck-2 city-2-loc-2 package-2 capacity-1 capacity-2)
   deleted: (in package-2 truck-2) (capacity truck-2 capacity-1)
   added: (at package-2 city-2-loc-2) (capacity truck-2 capacity-2)
   goals met: 2 of 4
11. (drive truck-2 city-2-loc-2 city-1-loc-4)
   deleted: (at truck-2 city-2-loc-2)
   added: (at truck-2 city-1-loc-4)
   goals met: 2 of 4
12. (drive truck-2 city-1-loc-4 city-1-loc-5)
   deleted: (at truck-2 city-1-loc-4)
   added: (at truck-2 city-1-loc-5)
   goals met: 2 of 4
13. (drive truck-2 city-1-loc-5 city-1-loc-1)
   deleted: (at truck-2 city-1-loc-5)
   added: (at truck-2 city-1-loc-1)
   goals met: 2 of 4
14. (pick-up truck-2 city-1-loc-1 package-4 capacity-1 capacity-2)
   deleted: (at package-4 city-1-loc-1) (capacity truck-2 capacity-2)
   added: (in package-4 truck-2) (capacity truck-2 capacity-1)
   goals met: 2 of 4
15. (drive truck-2 city-1-loc-1 city-1-loc-5)
   deleted: (at truck-2 city-1-loc-1)
   added: (at truck-2 city-1-loc-5)
   goals met: 2 of 4
16. (drive truck-2 city-1-loc-5 city-1-loc-3)
   deleted: (at truck-2 city-1-loc-5)
   added: (at truck-2 city-1-loc-3)
   goals met: 2 of 4
17. (pick-up truck-2 city-1-loc-3 package-1 capacity-0 capacity-1)
   deleted: (at package-1 city-1-loc-3) (capacity truck-2 capacity-1)
   added: (in package-1 truck-2) (capacity truck-2 capacity-0)
   goals met: 2 of 4
18. (drive truck-2 city-1-loc-3 city-1-loc-4)
   deleted: (at truck-2 city-1-loc-3)
   added: (at truck-2 city-1-loc-4)
   goals met: 2 of 4
19. (drive truck-2 city-1-loc-4 city-2-loc-2)
   deleted: (at truck-2 city-1-loc-4)
   added: (at truck-2 city-2-loc-2)
   goals met: 2 of 4
20. (drive truck-2 city-2-loc-2 city-2-loc-1)
   deleted: (at truck-2 city-2-loc-2)
   added: (at truck-2 city-2-loc-1)
   goals met: 2 of 4
21. (drive truck-2 city-2-loc-1 city-2-loc-4)
   deleted: (at truck-2 city-2-loc-1)
   added: (at truck-2 city-2-loc-4)
   goals met: 2 of 4
22. (drop truck-2 city-2-loc-4 package-1 capacity-0 capacity-1)
   deleted: (in package-1 truck-2) (capacity truck-2 capacity-0)
   added: (at package-1 city-2-loc-4) (capacity truck-2 capacity-1)
   goals met: 3 of 4
23. (drive truck-2 city-2-loc-4 city-2-loc-5)
   deleted: (at truck-2 city-2-loc-4)
   added: (at truck-2 city-2-loc-5)
   goals met: 3 of 4
24. (drop truck-2 city-2-loc-5 package-4 capacity-1 capacity-2)
   deleted: (in package-4 truck-2) (capacity truck-2 capacity-1)
   added: (at package-4 city-2-loc-5) (capacity truck-2 capacity-2)
   goals met: 4 of 4
